Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.help.ssh-tmux
source: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Mirror a remote host's tmux sessions into the current cmux window over SSH tmux control mode. Each session becomes a workspace, each window a tab, and each multi-pane window a native split. Requires the "Remote tmux" beta setting. If interactive authentication is needed, cmux runs ssh in this terminal and then retries over the shared connection. ~/.ssh/config aliases and settings are honored. Flags: --port <n> SSH port --identity <path> SSH identity file path --no-focus Do not select the mirror workspace or activate its window Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
ar: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] اعكس جلسات tmux للمضيف البعيد داخل نافذة cmux الحالية عبر وضع تحكم tmux بواسطة SSH. تصبح كل جلسة مساحة عمل، وكل نافذة علامة تبويب، وكل نافذة متعددة الأجزاء تقسيمًا أصليًا. يتطلب ذلك تفعيل الإصدار التجريبي "Remote tmux". عند الحاجة إلى مصادقة تفاعلية، يشغّل cmux أمر ssh في هذه الطرفية ثم يعيد المحاولة عبر الاتصال المشترك. تُحترم الأسماء المستعارة وإعدادات ~/.ssh/config. Flags: --port <n> منفذ SSH --identity <path> مسار ملف هوية SSH --no-focus عدم تحديد مساحة العمل المعكوسة أو تنشيط نافذتها Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
bs: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Preslikava tmux sesije udaljenog hosta u trenutni cmux prozor putem SSH tmux kontrolnog režima. Svaka sesija postaje radni prostor, svaki prozor kartica, a prozor s više okana izvorna podjela. Potrebno je uključiti beta opciju "Remote tmux". Ako je potrebna interaktivna autentifikacija, cmux pokreće ssh u ovom terminalu i zatim pokušava ponovo preko dijeljene veze. Poštuju se aliasi i postavke iz ~/.ssh/config. Flags: --port <n> SSH port --identity <path> putanja SSH identiteta --no-focus ne biraj preslikani radni prostor niti aktiviraj prozor Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
da: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Spejl en fjernværts tmux-sessioner i det aktuelle cmux-vindue via SSH tmux-kontroltilstand. Hver session bliver et arbejdsområde, hvert vindue en fane og hvert vindue med flere ruder en integreret opdeling. Kræver at betaindstillingen "Remote tmux" er slået til. Hvis interaktiv godkendelse er nødvendig, kører cmux ssh i denne terminal og prøver derefter igen via den delte forbindelse. Aliasser og indstillinger i ~/.ssh/config respekteres. Flags: --port <n> SSH-port --identity <path> sti til SSH-identitetsfil --no-focus vælg ikke det spejlede arbejdsområde eller aktivér vinduet Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
de: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Spiegelt die tmux-Sitzungen eines entfernten Hosts per SSH-tmux-Steuermodus in das aktuelle cmux-Fenster. Jede Sitzung wird zu einem Arbeitsbereich, jedes Fenster zu einem Tab und jedes Fenster mit mehreren Bereichen zu einer nativen Teilung. Erfordert die aktivierte Betaoption "Remote tmux". Wenn eine interaktive Authentifizierung nötig ist, führt cmux ssh in diesem Terminal aus und versucht es anschließend über die gemeinsame Verbindung erneut. Aliase und Einstellungen aus ~/.ssh/config werden berücksichtigt. Flags: --port <n> SSH-Port --identity <path> Pfad zur SSH-Identitätsdatei --no-focus Spiegel-Arbeitsbereich nicht auswählen und Fenster nicht aktivieren Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
es: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Refleja las sesiones tmux de un host remoto en la ventana actual de cmux mediante el modo de control tmux por SSH. Cada sesión se convierte en un espacio de trabajo, cada ventana en una pestaña y cada ventana con varios paneles en una división nativa. Requiere activar la función beta "Remote tmux". Si se necesita autenticación interactiva, cmux ejecuta ssh en este terminal y luego reintenta mediante la conexión compartida. Se respetan los alias y ajustes de ~/.ssh/config. Flags: --port <n> puerto SSH --identity <path> ruta del archivo de identidad SSH --no-focus no seleccionar el espacio reflejado ni activar su ventana Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
fr: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Reproduit les sessions tmux d’un hôte distant dans la fenêtre cmux actuelle via le mode de contrôle tmux sur SSH. Chaque session devient un espace de travail, chaque fenêtre un onglet et chaque fenêtre à plusieurs volets une division native. Nécessite l’option bêta "Remote tmux". Si une authentification interactive est nécessaire, cmux exécute ssh dans ce terminal puis réessaie via la connexion partagée. Les alias et réglages de ~/.ssh/config sont respectés. Flags: --port <n> port SSH --identity <path> chemin du fichier d’identité SSH --no-focus ne pas sélectionner l’espace miroir ni activer sa fenêtre Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
it: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Replica le sessioni tmux di un host remoto nella finestra cmux corrente tramite la modalità di controllo tmux su SSH. Ogni sessione diventa uno spazio di lavoro, ogni finestra una scheda e ogni finestra con più riquadri una suddivisione nativa. Richiede l’opzione beta "Remote tmux". Se serve l’autenticazione interattiva, cmux esegue ssh in questo terminale e poi riprova tramite la connessione condivisa. Gli alias e le impostazioni di ~/.ssh/config vengono rispettati. Flags: --port <n> porta SSH --identity <path> percorso del file di identità SSH --no-focus non selezionare lo spazio replicato né attivarne la finestra Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
ja: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] SSH の tmux コントロールモードで、リモートホストの tmux セッションを現在の cmux ウィンドウにミラーリングします。各セッションはワークスペースに、各ウィンドウはタブに、複数ペインのウィンドウはネイティブな分割になります。「Remote tmux」ベータ設定を有効にする必要があります。 対話型認証が必要な場合、cmux はこのターミナルで ssh を実行し、共有接続を使って再試行します。~/.ssh/config のエイリアスと設定も使用されます。 Flags: --port <n> SSH ポート --identity <path> SSH 識別ファイルのパス --no-focus ミラーワークスペースを選択せず、ウィンドウもアクティブにしない Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
ko: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] SSH tmux 제어 모드로 원격 호스트의 tmux 세션을 현재 cmux 창에 미러링합니다. 각 세션은 작업 공간이 되고, 각 창은 탭이 되며, 여러 패널이 있는 창은 네이티브 분할이 됩니다. "Remote tmux" 베타 설정을 켜야 합니다. 대화형 인증이 필요하면 cmux가 이 터미널에서 ssh를 실행한 뒤 공유 연결을 통해 다시 시도합니다. ~/.ssh/config의 별칭과 설정도 적용됩니다. Flags: --port <n> SSH 포트 --identity <path> SSH ID 파일 경로 --no-focus 미러 작업 공간을 선택하거나 창을 활성화하지 않음 Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
nb: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Speil tmux-øktene på en ekstern vert i det gjeldende cmux-vinduet via tmux-kontrollmodus over SSH. Hver økt blir et arbeidsområde, hvert vindu en fane og hvert vindu med flere ruter en integrert deling. Krever at betaalternativet "Remote tmux" er aktivert. Hvis interaktiv autentisering er nødvendig, kjører cmux ssh i denne terminalen og prøver deretter på nytt via den delte forbindelsen. Aliaser og innstillinger i ~/.ssh/config blir brukt. Flags: --port <n> SSH-port --identity <path> bane til SSH-identitetsfil --no-focus ikke velg det speilede arbeidsområdet eller aktiver vinduet Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
pl: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Odzwierciedla sesje tmux zdalnego hosta w bieżącym oknie cmux przez tryb sterowania tmux po SSH. Każda sesja staje się obszarem roboczym, każde okno kartą, a okno z wieloma panelami natywnym podziałem. Wymaga włączenia funkcji beta "Remote tmux". Jeśli potrzebne jest interaktywne uwierzytelnianie, cmux uruchamia ssh w tym terminalu, a następnie ponawia próbę przez współdzielone połączenie. Aliasy i ustawienia z ~/.ssh/config są respektowane. Flags: --port <n> port SSH --identity <path> ścieżka pliku tożsamości SSH --no-focus nie wybieraj obszaru lustrzanego ani nie aktywuj jego okna Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
pt_br: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Espelha as sessões tmux de um host remoto na janela atual do cmux pelo modo de controle tmux via SSH. Cada sessão vira um espaço de trabalho, cada janela uma aba e cada janela com vários painéis uma divisão nativa. Requer a opção beta "Remote tmux". Se for necessária autenticação interativa, o cmux executa ssh neste terminal e tenta novamente pela conexão compartilhada. Os aliases e ajustes de ~/.ssh/config são respeitados. Flags: --port <n> porta SSH --identity <path> caminho do arquivo de identidade SSH --no-focus não selecionar o espaço espelhado nem ativar sua janela Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
ru: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Отображает сеансы tmux удалённого узла в текущем окне cmux через режим управления tmux по SSH. Каждый сеанс становится рабочим пространством, каждое окно — вкладкой, а окно с несколькими панелями — нативным разделением. Требуется включить бета-функцию "Remote tmux". Если нужна интерактивная аутентификация, cmux запускает ssh в этом терминале, а затем повторяет попытку через общее соединение. Псевдонимы и настройки из ~/.ssh/config учитываются. Flags: --port <n> порт SSH --identity <path> путь к файлу идентификации SSH --no-focus не выбирать зеркальное пространство и не активировать его окно Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
th: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] มิเรอร์เซสชัน tmux ของโฮสต์ระยะไกลมายังหน้าต่าง cmux ปัจจุบันผ่านโหมดควบคุม tmux บน SSH แต่ละเซสชันจะเป็นพื้นที่ทำงาน แต่ละหน้าต่างจะเป็นแท็บ และหน้าต่างหลายบานจะเป็นการแบ่งแบบเนทีฟ ต้องเปิดใช้รุ่นเบต้า "Remote tmux" หากต้องยืนยันตัวตนแบบโต้ตอบ cmux จะเรียก ssh ในเทอร์มินัลนี้แล้วลองใหม่ผ่านการเชื่อมต่อที่ใช้ร่วมกัน โดยใช้ชื่อแทนและการตั้งค่าจาก ~/.ssh/config Flags: --port <n> พอร์ต SSH --identity <path> พาธไฟล์ข้อมูลประจำตัว SSH --no-focus ไม่เลือกพื้นที่ทำงานที่มิเรอร์หรือเปิดใช้งานหน้าต่าง Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
tr: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Uzak bir ana makinenin tmux oturumlarını SSH tmux denetim modu üzerinden geçerli cmux penceresine yansıtır. Her oturum bir çalışma alanına, her pencere bir sekmeye ve çok bölmeli her pencere yerel bir bölmeye dönüşür. "Remote tmux" beta ayarının etkin olması gerekir. Etkileşimli kimlik doğrulama gerekirse cmux bu terminalde ssh çalıştırır ve ardından paylaşılan bağlantı üzerinden yeniden dener. ~/.ssh/config içindeki takma adlar ve ayarlar kullanılır. Flags: --port <n> SSH bağlantı noktası --identity <path> SSH kimlik dosyası yolu --no-focus yansıtılan çalışma alanını seçme veya penceresini etkinleştirme Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
uk: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] Віддзеркалює сеанси tmux віддаленого вузла в поточному вікні cmux через режим керування tmux по SSH. Кожен сеанс стає робочим простором, кожне вікно — вкладкою, а вікно з кількома панелями — нативним поділом. Потрібно ввімкнути бета-функцію "Remote tmux". Якщо потрібна інтерактивна автентифікація, cmux запускає ssh у цьому терміналі, а потім повторює спробу через спільне з’єднання. Псевдоніми й налаштування з ~/.ssh/config враховуються. Flags: --port <n> порт SSH --identity <path> шлях до файлу ідентифікації SSH --no-focus не вибирати віддзеркалений простір і не активувати його вікно Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
zh_hans: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] 通过 SSH tmux 控制模式，将远程主机的 tmux 会话镜像到当前 cmux 窗口中。每个会话成为一个工作区，每个窗口成为一个标签页，多窗格窗口则成为原生分栏。需要启用“Remote tmux”测试功能。 如果需要交互式身份验证，cmux 会在此终端中运行 ssh，然后通过共享连接重试。系统会采用 ~/.ssh/config 中的别名和设置。 Flags: --port <n> SSH 端口 --identity <path> SSH 身份文件路径 --no-focus 不选择镜像工作区，也不激活其窗口 Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519
zh_hant: Usage: cmux ssh-tmux <destination> [--port <n>] [--identity <path>] [--no-focus] 透過 SSH tmux 控制模式，將遠端主機的 tmux 工作階段鏡像到目前的 cmux 視窗。每個工作階段會成為工作區，每個視窗會成為標籤頁，多窗格視窗則會成為原生分割。需要啟用「Remote tmux」測試功能。 若需要互動式驗證，cmux 會在此終端機中執行 ssh，然後透過共用連線重試。系統會採用 ~/.ssh/config 中的別名與設定。 Flags: --port <n> SSH 連接埠 --identity <path> SSH 身分檔案路徑 --no-focus 不選取鏡像工作區，也不啟用其視窗 Example: cmux ssh-tmux dev@my-host cmux ssh-tmux dev@my-host --port 2222 --identity ~/.ssh/id_ed25519

# cli.help.ssh-tmux.newWindow
source: Additional flag: --new-window Open the mirror in a dedicated new window
ar: خيار إضافي: --new-window فتح المرآة في نافذة جديدة مخصصة
bs: Dodatna opcija: --new-window Otvori zrcaljenje u namjenskom novom prozoru
da: Ekstra flag: --new-window Åbn spejlingen i et dedikeret nyt vindue
de: Zusätzliche Option: --new-window Spiegel in einem eigenen neuen Fenster öffnen
es: Opción adicional: --new-window Abrir el reflejo en una nueva ventana dedicada
fr: Option supplémentaire : --new-window Ouvrir le miroir dans une nouvelle fenêtre dédiée
it: Opzione aggiuntiva: --new-window Apri la replica in una nuova finestra dedicata
ja: 追加フラグ: --new-window 専用の新しいウィンドウでミラーを開く
ko: 추가 플래그: --new-window 전용 새 창에서 미러 열기
nb: Ekstra flagg: --new-window Åpne speilet i et eget nytt vindu
pl: Dodatkowa flaga: --new-window Otwórz kopię lustrzaną w dedykowanym nowym oknie
pt_br: Opção adicional: --new-window Abrir o espelho em uma nova janela dedicada
ru: Дополнительный флаг: --new-window Открыть зеркало в отдельном новом окне
th: แฟล็กเพิ่มเติม: --new-window เปิดมิเรอร์ในหน้าต่างใหม่แยกต่างหาก
tr: Ek bayrak: --new-window Yansımayı ayrılmış yeni bir pencerede aç
uk: Додатковий прапорець: --new-window Відкрити дзеркало в окремому новому вікні
zh_hans: 其他选项: --new-window 在专用的新窗口中打开镜像
zh_hant: 其他選項: --new-window 在專用的新視窗中開啟鏡像

# cli.help.ssh.initialCommand
source: Initial command: --command <text> Run text once in the initial remote terminal after shell startup Example: cmux ssh dev@my-host --command 'omp "investigate auth"'
ar: الأمر الأولي: --command <text> شغّل نص الأمر مرة واحدة في الطرفية البعيدة الأولية بعد بدء الصدفة مثال: cmux ssh dev@my-host --command 'omp "investigate auth"'
bs: Početna naredba: --command <text> Pokrenite tekst naredbe jednom u početnom udaljenom terminalu nakon pokretanja ljuske Primjer: cmux ssh dev@my-host --command 'omp "investigate auth"'
da: Indledende kommando: --command <text> Kør kommandoteksten én gang i den første fjernterminal efter shell-start Eksempel: cmux ssh dev@my-host --command 'omp "investigate auth"'
de: Initialer Befehl: --command <text> Befehlstext nach dem Shell-Start einmal im ersten Remote-Terminal ausführen Beispiel: cmux ssh dev@my-host --command 'omp "investigate auth"'
es: Comando inicial: --command <text> Ejecutar el texto del comando una vez en el terminal remoto inicial después de iniciar el shell Ejemplo: cmux ssh dev@my-host --command 'omp "investigate auth"'
fr: Commande initiale : --command <text> Exécuter le texte de la commande une seule fois dans le terminal distant initial après le démarrage du shell Exemple : cmux ssh dev@my-host --command 'omp "investigate auth"'
it: Comando iniziale: --command <text> Esegui il testo del comando una volta nel terminale remoto iniziale dopo l'avvio della shell Esempio: cmux ssh dev@my-host --command 'omp "investigate auth"'
ja: 初期コマンド: --command <text> シェル起動後、最初のリモートターミナルでテキストを一度だけ実行 例: cmux ssh dev@my-host --command 'omp "investigate auth"'
ko: 초기 명령: --command <text> 셸 시작 후 첫 원격 터미널에서 명령 텍스트를 한 번만 실행 예: cmux ssh dev@my-host --command 'omp "investigate auth"'
nb: Første kommando: --command <text> Kjør kommandoteksten én gang i den første eksterne terminalen etter skalloppstart Eksempel: cmux ssh dev@my-host --command 'omp "investigate auth"'
pl: Polecenie początkowe: --command <text> Uruchom tekst polecenia jeden raz w początkowym zdalnym terminalu po starcie powłoki Przykład: cmux ssh dev@my-host --command 'omp "investigate auth"'
pt_br: Comando inicial: --command <text> Execute o texto do comando uma vez no terminal remoto inicial após iniciar o shell Exemplo: cmux ssh dev@my-host --command 'omp "investigate auth"'
ru: Начальная команда: --command <text> Выполнить текст команды один раз в исходном удалённом терминале после запуска оболочки Пример: cmux ssh dev@my-host --command 'omp "investigate auth"'
th: คำสั่งเริ่มต้น: --command <text> เรียกใช้ข้อความคำสั่งหนึ่งครั้งในเทอร์มินัลระยะไกลเริ่มต้นหลังจากเชลล์เริ่มทำงาน ตัวอย่าง: cmux ssh dev@my-host --command 'omp "investigate auth"'
tr: İlk komut: --command <text> Komut metnini kabuk başladıktan sonra ilk uzak terminalde bir kez çalıştırın Örnek: cmux ssh dev@my-host --command 'omp "investigate auth"'
uk: Початкова команда: --command <text> Виконати текст команди один раз у початковому віддаленому терміналі після запуску оболонки Приклад: cmux ssh dev@my-host --command 'omp "investigate auth"'
zh_hans: 初始命令： --command <text> 在 shell 启动后于初始远程终端中运行一次命令文本 示例： cmux ssh dev@my-host --command 'omp "investigate auth"'
zh_hant: 初始命令： --command <text> 在 shell 啟動後於初始遠端終端機中執行一次命令文字 範例： cmux ssh dev@my-host --command 'omp "investigate auth"'

# cli.help.ssh.mosh
source: Mosh terminal transport: --transport <ssh|mosh> Interactive terminal transport (default: ssh) SSH continues to handle remote features; Mosh carries only the interactive terminal. If Mosh is missing locally or remotely, cmux reports it and uses SSH. Example: cmux ssh dev@my-host --transport mosh
ar: وسيط نقل طرفية Mosh: --transport <ssh|mosh> وسيط نقل طرفية تفاعلي (الافتراضي: ssh) يستمر SSH في معالجة الميزات البعيدة؛ بينما ينقل Mosh الجزء التفاعلي فقط من الطرفية. إذا كان Mosh غير متوفر محليًا أو عن بعد، فسيقوم cmux بالإبلاغ عن ذلك ويستخدم SSH. مثال: cmux ssh dev@my-host --transport mosh
bs: Mosh transport terminala: --transport <ssh|mosh> Transport interaktivnog terminala (zadano: ssh) SSH upravlja udaljenim funkcijama, a Mosh prenosi samo terminal. Ako Mosh nedostaje lokalno ili udaljeno, cmux to prijavljuje i koristi SSH. Primjer: cmux ssh dev@my-host --transport mosh
da: Mosh-terminaltransport: --transport <ssh|mosh> Interaktiv terminaltransport (standard: ssh) SSH håndterer fjernfunktioner, og Mosh bærer kun terminalen. Hvis Mosh mangler lokalt eller på fjernværten, oplyser cmux det og bruger SSH. Eksempel: cmux ssh dev@my-host --transport mosh
de: Mosh-Terminaltransport: --transport <ssh|mosh> Interaktiver Terminaltransport (Standard: ssh) SSH übernimmt weiterhin Remote-Funktionen; Mosh überträgt nur das interaktive Terminal. Wenn Mosh lokal oder remote fehlt, meldet cmux dies und verwendet SSH. Beispiel: cmux ssh dev@my-host --transport mosh
es: Transporte de terminal Mosh: --transport <ssh|mosh> Transporte de terminal interactivo (por defecto: ssh) SSH continúa manejando las funciones remotas; Mosh solo transporta la terminal interactiva. Si falta Mosh de forma local o remota, cmux lo reporta y utiliza SSH. Ejemplo: cmux ssh dev@my-host --transport mosh
fr: Transport de terminal Mosh : --transport <ssh|mosh> Transport de terminal interactif (par défaut : ssh) SSH continue de gérer les fonctionnalités distantes ; Mosh ne prend en charge que le terminal interactif. Si Mosh est manquant localement ou à distance, cmux le signale et utilise SSH. Exemple : cmux ssh dev@my-host --transport mosh
it: Trasporto terminale Mosh: --transport <ssh|mosh> Trasporto del terminale interattivo (predefinito: ssh) SSH gestisce le funzioni remote e Mosh trasporta solo il terminale. Se Mosh manca in locale o in remoto, cmux lo segnala e usa SSH. Esempio: cmux ssh dev@my-host --transport mosh
ja: Mosh ターミナル転送: --transport <ssh|mosh> インタラクティブなターミナル転送（デフォルト: ssh） リモート機能は引き続き SSH が処理し、Mosh はインタラクティブな ターミナルのみを転送します。ローカルまたはリモートに Mosh がない場合、cmux はそれを報告して SSH を使用します。 例: cmux ssh dev@my-host --transport mosh
ko: Mosh 터미널 전송: --transport <ssh|mosh> 대화형 터미널 전송 (기본값: ssh) SSH는 계속해서 원격 기능을 처리하며, Mosh는 대화형 터미널만 전송합니다. 로컬 또는 원격에 Mosh가 없는 경우, cmux는 이를 보고하고 SSH를 사용합니다. 예시: cmux ssh dev@my-host --transport mosh
nb: Mosh-terminaltransport: --transport <ssh|mosh> Interaktiv terminaltransport (standard: ssh) SSH håndterer eksterne funksjoner, og Mosh bærer bare terminalen. Hvis Mosh mangler lokalt eller eksternt, sier cmux fra og bruker SSH. Eksempel: cmux ssh dev@my-host --transport mosh
pl: Transport terminala Mosh: --transport <ssh|mosh> Transport terminala interaktywnego (domyślnie: ssh) SSH obsługuje funkcje zdalne, a Mosh tylko terminal. Jeśli brakuje Mosh lokalnie lub zdalnie, cmux informuje o tym i używa SSH. Przykład: cmux ssh dev@my-host --transport mosh
pt_br: Transporte de terminal Mosh: --transport <ssh|mosh> Transporte do terminal interativo (padrão: ssh) O SSH gerencia os recursos remotos e o Mosh transporta apenas o terminal. Se faltar Mosh local ou remotamente, o cmux informa e usa SSH. Exemplo: cmux ssh dev@my-host --transport mosh
ru: Транспорт терминала Mosh: --transport <ssh|mosh> Транспорт интерактивного терминала (по умолчанию: ssh) SSH управляет удалёнными функциями, а Mosh передаёт только терминал. Если Mosh отсутствует локально или удалённо, cmux сообщает об этом и использует SSH. Пример: cmux ssh dev@my-host --transport mosh
th: การส่งเทอร์มินัล Mosh: --transport <ssh|mosh> การส่งเทอร์มินัลแบบโต้ตอบ (ค่าเริ่มต้น: ssh) SSH จัดการคุณสมบัติระยะไกล ส่วน Mosh ส่งเฉพาะเทอร์มินัล หากไม่มี Mosh cmux จะแจ้งและใช้ SSH ตัวอย่าง: cmux ssh dev@my-host --transport mosh
tr: Mosh terminal aktarımı: --transport <ssh|mosh> Etkileşimli terminal aktarımı (varsayılan: ssh) Uzak özellikleri SSH yönetir, Mosh yalnızca terminali taşır. Mosh yerelde veya uzakta yoksa cmux bunu bildirir ve SSH kullanır. Örnek: cmux ssh dev@my-host --transport mosh
uk: Транспорт термінала Mosh: --transport <ssh|mosh> Транспорт інтерактивного термінала (типово: ssh) SSH керує віддаленими функціями, а Mosh передає лише термінал. Якщо Mosh відсутній локально або віддалено, cmux повідомляє про це й використовує SSH. Приклад: cmux ssh dev@my-host --transport mosh
zh_hans: Mosh 终端传输： --transport <ssh|mosh> 交互式终端传输（默认：ssh） SSH 继续处理远程功能；Mosh 仅承载交互式 终端。如果本地或远程缺少 Mosh，cmux 会进行报告并使用 SSH。 示例： cmux ssh dev@my-host --transport mosh
zh_hant: Mosh 終端機傳輸： --transport <ssh|mosh> 互動式終端機傳輸 (預設值：ssh) SSH 繼續處理遠端功能；Mosh 僅承載互動式 終端機。如果本機或遠端缺少 Mosh，cmux 會回報並使用 SSH。 範例： cmux ssh dev@my-host --transport mosh
